ОсновныеОбъектыЗанятие6/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>НациональнаяВалюта</name>
      <description>Национальная валюта</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКурса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

ОсновныеОбъектыЗанятие6/src/Catalogs/Валюты/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПолучитьКурс(Команда)
	
	АктуальныеДанныеПоВалюте = НаСервереМожноВызватьСКлиента.ПолучитьАктуальныеДанныеПоВалюте( 
	Элементы.Список.ТекущаяСтрока, ТекущаяДата());
	
	КурсЧислитель = АктуальныеДанныеПоВалюте.КурсЧислитель;
	КурсЗнаменатель = АктуальныеДанныеПоВалюте.КурсЗнаменатель;
	
	
	СтруктураСДаннымиТекущейСтроки = Элементы.Список.ТекущиеДанные;
	
	
	БуквенныйКод = СтруктураСДаннымиТекущейСтроки.БуквенныйКод;
	
	Текст = "Курс валюты " + БуквенныйКод + " по отношению к Национальной валюте на сегодня составляет "
	+ КурсЧислитель + " руб. за " + КурсЗнаменатель + " ед.";
	
	ПоказатьПредупреждение(
	Новый ОписаниеОповещения("ПолучитьКурсЗавершение", ЭтотОбъект)
	, Текст , 10 , "Сегодня " + ТекущаяДата() );
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКурсЗавершение(ДополнительныеПараметры) Экспорт
	
	ПоказатьОповещениеПользователя("Курс показан");
	
КонецПроцедуры
